### 1 jupyter 사용방법
* h : help
- a, b :셀추가
* m, y : 마크업 또는 코드
* dd : 셀 한칸 삭제
* 컨트롤 + 엔터 : 실행

In [49]:
import pandas as pd

In [50]:
df = pd.read_csv("data/1.pandas.csv")

In [51]:
name = "홍길동"
print(name)

홍길동

In [52]:
#마지막에 있는 값은 자동출력
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [53]:
#Serise
print(df)
print("="*20)
print(df['name'])

print("="*20)
print(df.age)

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50
====================
0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object
====================
0    20
1    30
2    40
3    50
Name: age, dtype: int64

In [54]:
#DataFrame 형식으로 가져온다.
#여러개의 값을 가져오고자 하는경우 [[]]
print("="*20)
print(df[['name','age']])

====================
   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50

In [55]:
#인덱싱 : 인섹스의 범위를 지정한다
print("="*20)
print(df[1:3])#1~2까지
print(df[:3])#처음부터2까지
print(df[1:])#1~끝까지의 데이터

====================
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [56]:
print("="*20)
#loc : DF.loc[index조건식,컬럼 조건식]

print(df.loc[1:3,'name'])#3번까지 가져옴
print(df.loc[1:3,['name','score']])
print("="*20)
print(df.loc[ :,'name':'grade']) #앞쪽 전체 :
print("="*20)
print(df.loc[ 1:3,])# 뒷쪽 전체 공백
print("="*20)
print(df['grade']=='A')#참 또는 거짓 값을 가져옴
print(df[df['grade']=='A'])#참에 대한 값들만 가져옴

====================
1     Cho
2    Choi
3      jo
Name: name, dtype: object
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
====================
   name  score grade
0   Kim  100.0     A
1   Cho   95.0     A
2  Choi   90.5     B
3    jo   85.7     B
====================
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50
====================
0     True
1     True
2    False
3    False
Name: grade, dtype: bool
  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

### 2. DataFrame 삭제
* 인덱스를 기준으로 행 삭제

In [57]:
df.drop(2)

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [58]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [66]:
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40

In [67]:
df.drop(0,inplace=True)
df

   name  score grade  age
2  Choi   90.5     B   40

#### axis
* 열 또는 행 중에 어떠한 값을 기준으로 설정할지 결정
* axis는 기본적으로 행(index)로 설정 되면 axis = 0이다
* axis =0 :index 삭제
* axis =1 :컬럼,열 삭제

In [68]:
df

   name  score grade  age
2  Choi   90.5     B   40

In [69]:
df = pd.read_csv("data/1.pandas.csv")

In [70]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [72]:
df.drop(0, axis=0, inplace = True)
df

   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

### Boolean 처리
* 특정 데이터 연산하면 결과는 True, False이다
* DataFrame에 Ture값을 전달하면 해당 위치의 값들을 얻어온다.

In [74]:
df = pd.read_csv("data/1.pandas.csv")
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [75]:
df['score']

0    100.0
1     95.0
2     90.5
3     85.7
Name: score, dtype: float64

In [76]:
df['score'] < 95

0    False
1    False
2     True
3     True
Name: score, dtype: bool

In [78]:
df[df['score'] <95]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [83]:
df[df['score'] <95]['name']

2    Choi
3      jo
Name: name, dtype: object

In [84]:
df[df['score'] <95][['name']]

   name
2  Choi
3    jo

In [86]:
df.loc[df['score']<95,'name']

2    Choi
3      jo
Name: name, dtype: object

In [89]:
df.loc[df['score']<95,['name','score']]

   name  score
2  Choi   90.5
3    jo   85.7

In [93]:
df.loc[df['score']<95,'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

In [110]:
df[df['score']<95].loc[:,'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

### 4. DataFrame 명령어

In [111]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [112]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

In [113]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [114]:
df.values

array([['Kim', 100.0, 'A', 20],
       ['Cho', 95.0, 'A', 30],
       ['Choi', 90.5, 'B', 40],
       ['jo', 85.7, 'B', 50]], dtype=object)

* dtypes
    - 자료형을 알려준다
    - object : 문자열
    - float : 실수
    - int : 정수

In [115]:
df.dtypes

name      object
score    float64
grade     object
age        int64
dtype: object

In [117]:
df['grade']

0    A
1    A
2    B
3    B
Name: grade, dtype: object

In [118]:
df['grade'].isin(['A'])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [124]:
df[df['grade'].isin(['A'])]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [125]:
df[df['grade'].isin(['A'])],['name','grade']

(  name  score grade  age
 0  Kim  100.0     A   20
 1  Cho   95.0     A   30,
 ['name', 'grade'])

In [128]:
index_name = ['김씨1','김씨2','김씨3','김씨4']
df.index = index_name
df

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40
김씨4    jo   85.7     B   50

In [129]:
df[1:3]

     name  score grade  age
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40

In [130]:
df["김씨1":"김씨3"]

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40

In [133]:
qf = pd.read_csv("data/1.Quiz.csv")
qf

   경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
0   39060    7313    3627     309     300     B
1   39896    6967    4168    1771     350     B
2   42005    6873    4088    1954     450     A
3   43621    6626    4424    2244     560     A
4   41702    8675    4606    3146    1300     A
5   41266   10622    4984    3945    2395     A
6   32427    9228    5570    5766    3786     C

In [134]:
# index설정
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']
qf.index = index_list
qf

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A
2017   32427    9228    5570    5766    3786     C

In [137]:
qf.columns

Index(['경부선KTX', '호남선KTX', '경전선KTX', '전라선KTX', '동해선KTX', '경부선등급'], dtype='object')

In [138]:
qf['경부선KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

In [139]:
qf[['경부선KTX','호남선KTX']]

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

In [150]:
qf.dtypes

경부선KTX     int64
호남선KTX     int64
경전선KTX     int64
전라선KTX     int64
동해선KTX     int64
경부선등급     object
dtype: object

In [171]:
qf[1:5]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

In [185]:
df[df['score']<95].loc[:,'name':'grade']

     name  score grade
김씨3  Choi   90.5     B
김씨4    jo   85.7     B

In [219]:
#qf.loc[:,'경부선KTX']
qf[['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2013   42005
2014   43621
2015   41702
2016   41266
2017   32427

In [227]:
qf[qf.index=='2011']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B

In [247]:
qf[2:5]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

In [286]:
qf.loc["2012":"2014",['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [297]:
qf[1:4][['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [298]:
qf.loc['2015':'2017',['경부선KTX','호남선KTX','동해선KTX']]

      경부선KTX  호남선KTX  동해선KTX
2015   41702    8675    1300
2016   41266   10622    2395
2017   32427    9228    3786

In [312]:
qf[qf['경부선등급'].isin(['B','C'])]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

In [320]:
qf.loc[['2011','2012','2017'],['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2017   32427